test/xml/request_signed.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><wsu:Timestamp xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="TS-86F63C3CAD8F5DC3ED97"><wsu:Created>2020-03-12T06:56:12+00:00</wsu:Created><wsu:Expires>2020-03-12T07:26:12+00:00</wsu:Expires></wsu:Timestamp><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"></ds:SignatureMethod><ds:Reference URI="#TS-86F63C3CAD8F5DC3ED97"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"></ds:DigestMethod><ds:DigestValue>TuNdC4ZJz0SiDulHLtOuOqOqdx4=</ds:DigestValue></ds:Reference><ds:Reference URI="#ID-86F63C3CAD8F5DC3ED97"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"></ds:DigestMethod><ds:DigestValue>GU/Qzy1NQsU8rRJ5Mlpqj4Xr0mE=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>AX8x+w54Q5cx6dHATMSFKN4w3Kj+yR+VrtmeE6+DeZE51zFz9Jl5ittR309bU5ZwjoGp3rkFmfNWDPVVu0ccGAth4cbXmm3GTiqBaTfjU/ryWoBShrH+d9OIfPAKbe9QEfSgdKYSWmY1Bov0u6NObR28dmDr4yorLaqzyX5ClTLww5ToeUYGyjYAnTmpByyzIUJASLuB798UBeYsjeTaGY4inWyUS/QXONxJyf7rXzkj7/K9lhdAnCe5EfRjUYuvDRFQFk9jyehU1JHEumBek6N4yHPbSb+4Y4qzJjqz/rwzEprl+96fW1vDRDuc2tI+zkGTmiuNr81ZSAL45mgR5A==</ds:SignatureValue><ds:KeyInfo xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="KI-86F63C3CAD8F5DC3ED97"><wsse:SecurityTokenReference wsu:Id="STR-86F63C3CAD8F5DC3ED97"><ds:X509Data><ds:X509IssuerName>CN=MPaySampleRootCA</ds:X509IssuerName><ds:X509SerialNumber>-145210810847813629119348699648824586260</ds:X509SerialNumber></ds:X509Data></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature></wsse:Security></soapenv:Header><soapenv:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="ID-86F63C3CAD8F5DC3ED97"><mpay:GetOrderDetails xmlns:mpay="https://mpay.gov.md/"><mpay:query><mpay:OrderKey>3BEEA3B3-B2C3-46AC-96F4-44FC4DAA9AED</mpay:OrderKey><mpay:ServiceID>MPaySampleService</mpay:ServiceID><mpay:Language>ro</mpay:Language></mpay:query></mpay:GetOrderDetails></soapenv:Body></soapenv:Envelope>